Repository: hammerheart92/FurFriendDiary
Catalog: lib/l10n/app_*.arb
Languages: ro

# homeGreeting
source: Hello, furry friend!
ro: Salut, prieten blănos!

source: Medications
ro: Medicamente

source: All
ro: Toate

source: Search medications...
ro: Caută medicamente...

source: Add Medication
ro: Adaugă Medicament

source: No Pet Selected
ro: Niciun animal selectat

# pleaseSetupPetFirst
source: Please set up a pet profile first
ro: Vă rugăm să creați mai întâi un profil de animal

source: No active medications
ro: Niciun medicament activ

source: No medications found
ro: Nu s-au găsit medicamente

source: No inactive medications
ro: Niciun medicament inactiv

# noMedicationsMatchSearch
source: No medications match your search
ro: Niciun medicament nu corespunde căutării

# noProtocolSelected
source: No vaccination protocol selected
ro: Niciun protocol de vaccinare selectat

# tryAdjustingSearchTerms
source: Try adjusting your search terms
ro: Încercați să ajustați termenii de căutare

source: Error loading medications
ro: Eroare la încărcarea medicamentelor

source: Retry
ro: Reîncercare

# medicationMarkedInactive
source: Medication marked as inactive
ro: Medicament marcat ca inactiv

# medicationMarkedActive
source: Medication marked as active
ro: Medicament marcat ca activ

source: Failed to update medication
ro: Actualizarea medicamentului a eșuat

source: Delete Medication
ro: Șterge Medicament

# deleteMedicationConfirm
source: Are you sure you want to delete "{medicationName}"? This action cannot be undone.
ro: Sigur doriți să ștergeți "{medicationName}"? Această acțiune nu poate fi anulată.

source: Cancel
ro: Anulare

source: Delete
ro: Șterge

source: Medication deleted successfully
ro: Medicament șters cu succes

source: Failed to delete medication
ro: Ștergerea medicamentului a eșuat

source: Appointments
ro: Programări

source: Upcoming
ro: Viitoare

source: Completed
ro: Finalizate

source: Search appointments...
ro: Caută programări...

source: Add Appointment
ro: Adaugă Programare

source: Edit Appointment
ro: Editează Programare

source: No upcoming appointments
ro: Nicio programare viitoare

source: No appointments found
ro: Nu s-au găsit programări

source: No completed appointments
ro: Nicio programare finalizată

# noAppointmentsMatchSearch
source: No appointments match your search
ro: Nicio programare nu corespunde căutării

source: Error loading appointments
ro: Eroare la încărcarea programărilor

source: Feedings
ro: Hrăniri

# petFeedings
source: {petName} - Feedings
ro: {petName} - Hrăniri

source: Home
ro: Acasă

# petHome
source: {petName} - Home
ro: {petName} - Acasă

# noFeedingsRecorded
source: No feedings recorded for {petName} yet
ro: Nicio hrănire înregistrată pentru {petName} încă

# noFeedingsRecordedGeneric
source: No feedings recorded yet
ro: Nicio hrănire înregistrată încă

source: Add first feeding
ro: Adaugă prima hrănire

source: Error loading feedings
ro: Eroare la încărcarea hrănirilor

# addNewFeeding
source: Add a new feeding
ro: Adaugă o hrănire nouă

source: Food type
ro: Tip de mâncare

# foodTypeHint
source: e.g., Dry Food, Wet Food, Treats
ro: de ex., Mâncare uscată, Mâncare umedă, Recompense

# pleaseEnterFoodType
source: Please enter a food type
ro: Vă rugăm să introduceți un tip de mâncare

# foodTypeDryFood
source: Dry Food
ro: Mâncare Uscată

# foodTypeWetFood
source: Wet Food
ro: Mâncare Umedă

# foodTypeTreats
source: Treats
ro: Recompense

# foodTypeRawFood
source: Raw Food
ro: Mâncare Crudă

# foodTypeChicken
source: Chicken
ro: Pui

# foodTypeFish
source: Fish
ro: Pește

# foodTypeTurkey
source: Turkey
ro: Curcan

# foodTypeBeef
source: Beef
ro: Vită

# foodTypeVegetables
source: Vegetables
ro: Legume

# foodTypeOther
source: Other (Custom)
ro: Altele (Personalizat)

# foodTypeCustomPlaceholder
source: Enter custom food type
ro: Introduceți un tip de mâncare personalizat

source: Clear
ro: Curăță

source: Coming soon
ro: În curând

source: Add
ro: Adaugă

# feedingAdded
source: Feeding "{foodType}" added
ro: Hrănire "{foodType}" adăugată

source: Failed to save feeding
ro: Salvarea hrănirii a eșuat

source: Mixed
ro: Mixt

source: Save
ro: Salvează

source: Medication Information
ro: Informații Medicament

source: Medication Name *
ro: Nume Medicament *

# medicationNameHint
source: e.g., Apoquel, Heartgard
ro: de ex., Apoquel, Heartgard

source: Please enter medication name
ro: Vă rugăm să introduceți numele medicamentului

source: Dosage
ro: Dozaj

# dosageHint
source: e.g., 5mg, 1 tablet, 2ml
ro: de ex., 5mg, 1 tabletă, 2ml

source: Please enter dosage
ro: Vă rugăm să introduceți dozajul

source: Frequency
ro: Frecvență

# frequencyOnceDaily
source: Once Daily
ro: O dată pe zi

# frequencyTwiceDaily
source: Twice Daily
ro: De două ori pe zi

# frequencyThreeTimesDaily
source: Three Times Daily
ro: De trei ori pe zi

# frequencyFourTimesDaily
source: Four times daily
ro: De patru ori pe zi

# frequencyEveryOtherDay
source: Every other day
ro: Din două în două zile

# frequencyWeekly
source: Weekly
ro: Săptămânal

# frequencyAsNeeded
source: As Needed
ro: La nevoie

# frequencyCustom
source: Custom
ro: Personalizat

source: Administration Method *
ro: Metodă de Administrare *

# administrationMethodTopical
source: Topical
ro: Topic

# administrationMethodInjection
source: Injection
ro: Injecție

# administrationMethodEyeDrops
source: Eye drops
ro: Picături pentru ochi

# administrationMethodEarDrops
source: Ear drops
ro: Picături pentru urechi

# administrationMethodInhaled
source: Inhaled
ro: Inhalat

# administrationMethodOther
source: Other
ro: Altele

source: Schedule
ro: Program

source: Start Date
ro: Data de Început

source: Has End Date
ro: Are Dată de Încheiere

source: Ongoing medication
ro: Medicament în curs

source: End Date
ro: Data de Încheiere

source: Select end date
ro: Selectați data de încheiere

source: Administration Times
ro: Timp de administrare

source: Add time
ro: Adaugă oră

# time
source: Time {number}
ro: Ora {number}

source: Additional Notes
ro: Notițe Suplimentare

# additionalNotesHint
source: Add any additional notes, special instructions, or reminders...
ro: Adăugați notițe, instrucțiuni speciale sau mementouri...

source: Save Medication
ro: Salvează Medicament

# noActivePetFound
source: No active pet found. Please select a pet first.
ro: Niciun animal activ găsit. Vă rugăm să selectați mai întâi un animal.

source: Medication added successfully!
ro: Medicament adăugat cu succes!

# failedToAddMedication
source: Failed to add medication: {error}
ro: Adăugarea medicamentului a eșuat: {error}

source: Medication Details
ro: Detalii Medicament

source: Basic Information
ro: Informații de Bază

source: Edit Medication
ro: Editează Medicament

source: Ongoing
ro: În curs

source: Duration
ro: Durată

source: Notes
ro: Notițe

source: Save Changes
ro: Salvează Modificările

source: Mark Inactive
ro: Marchează ca Inactiv

source: Mark Active
ro: Marchează ca Activ

source: Appointment Information
ro: Informații despre Programare

source: Veterinarian
ro: Veterinar

# veterinarianHint
source: e.g., Dr. Smith, Dr. Johnson
ro: de ex., Dr. Popescu, Dr. Ionescu

# pleaseEnterVeterinarian
source: Please enter veterinarian name
ro: Vă rugăm să introduceți numele veterinarului

source: Clinic
ro: Clinică

# clinicHint
source: e.g., Animal Hospital, Vet Clinic
ro: de ex., Spital Veterinar, Clinică Veterinară

# pleaseEnterClinic
source: Please enter clinic name
ro: Vă rugăm să introduceți numele clinicii

source: Enter manually
ro: Adaugă manual

source: Reason
ro: Motiv

# reasonHint
source: e.g., Checkup, Vaccination, Surgery
ro: de ex., Control, Vaccinare, Operație

# pleaseEnterReason
source: Please enter reason for appointment
ro: Vă rugăm să introduceți motivul programării

# appointmentReasonCheckup
source: Checkup
ro: Control de Rutină

# appointmentReasonVaccination
source: Vaccination
ro: Vaccinare

# appointmentReasonSurgery
source: Surgery
ro: Operație

# appointmentReasonEmergency
source: Emergency
ro: Urgență

# appointmentReasonFollowUp
source: Follow-up
ro: Control Post-Procedură

# appointmentReasonDentalCleaning
source: Dental Cleaning
ro: Curățare Dentară

# appointmentReasonGrooming
source: Grooming
ro: Îngrijire

# appointmentReasonBloodTest
source: Blood Test
ro: Analize de Sânge

# appointmentReasonXRay
source: X-Ray
ro: Radiografie

# appointmentReasonSpayingNeutering
source: Spaying/Neutering
ro: Sterilizare

# appointmentReasonOther
source: Other (Custom)
ro: Altele (Personalizat)

# appointmentReasonCustomPlaceholder
source: Enter custom reason
ro: Introduceți un motiv personalizat

source: Appointment Date
ro: Data Programării

source: Appointment Time
ro: Ora Programării

source: Status
ro: Stare

source: Mark as Completed
ro: Marchează ca Finalizat

source: Appointment completed
ro: Programare finalizată

source: Appointment pending
ro: Programare în așteptare

source: Update Appointment
ro: Actualizează Programare

source: Save Appointment
ro: Salvează Programare

source: Appointment updated successfully!
ro: Programare actualizată cu succes!

source: Appointment added successfully!
ro: Programare adăugată cu succes!

# failedToSaveAppointment
source: Failed to save appointment: {error}
ro: Salvarea programării a eșuat: {error}

source: Walks
ro: Plimbări

source: Today
ro: Astăzi

source: Tomorrow
ro: Mâine

# overdueByDays
source: Overdue by {days} days
ro: Întârziat cu {days} zile

# inDays
source: In {days} days
ro: În {days} zile

source: Starts Tomorrow
ro: Începe Mâine

# startsInDays
source: Starts in {days} days
ro: Începe în {days} zile

# treatmentCompleted
source: Completed
ro: Finalizat

source: Yesterday
ro: Ieri

source: This Week
ro: Săptămâna Aceasta

source: Add walk
ro: Adaugă plimbare

source: Start
ro: Început

# durationMin
source: Duration
ro: Durată

source: Distance
ro: Distanță

# surfaceLabel
source: Surface
ro: Suprafață

# surfacePaved
source: paved
ro: pavat

# surfaceGravel
source: gravel
ro: pietriș

# surfaceMixed
source: mixed
ro: mixt

source: Pace
ro: Ritm

source: No walks yet
ro: Nicio plimbare încă

# trackFirstWalk
source: Track your first walk to see distance and duration here.
ro: Înregistrați prima plimbare pentru a vedea distanța și durata aici.

source: Add first walk
ro: Adaugă prima plimbare

source: Walk details
ro: Detalii plimbare

source: Close
ro: Închide

source: No notes
ro: Nicio notiță

source: Optional
ro: Opțional

source: Upcoming Care
ro: Îngrijiri viitoare

source: Required
ro: Obligatoriu

# enterPositiveNumber
source: Enter a positive number
ro: Introduceți un număr pozitiv

source: Walk added successfully!
ro: Plimbare adăugată cu succes!

# walkDetailsFor
source: Walk details for {walkInfo}
ro: Detalii plimbare pentru {walkInfo}

source: Reports
ro: Rapoarte

source: Health
ro: Sănătate

source: Activity
ro: Activitate

source: Search reports...
ro: Caută rapoarte...

source: Generate Report
ro: Generează Raport

source: Health Summary
ro: Rezumat Sănătate

source: Activity Report
ro: Raport Activitate

source: Veterinary Records
ro: Înregistrări Veterinare

source: Generated
ro: Generat

source: Period
ro: Perioadă

source: Data
ro: Date

source: Summary
ro: Rezumat

source: items
ro: articole

source: feeds
ro: hrăniri

source: visits
ro: vizite

source: out of
ro: din

source: avg
ro: medie

source: per day
ro: pe zi

source: Generated on
ro: Generat pe

source: at
ro: la

source: days
ro: zile

source: Total Feedings
ro: Hrăniri Totale

source: Total Walks
ro: Plimbări Totale

source: Daily Average
ro: Medie Zilnică

source: In period
ro: În perioadă

source: Feeding History
ro: Istoric Hrănire

source: Date
ro: Data

source: Type
ro: Tip

source: Amount
ro: Cantitate

source: Dry Food
ro: Mâncare Uscată

source: Wet Food
ro: Mâncare Umedă

source: Treats
ro: Recompense

# timeLabel
source: Time
ro: Ora

source: Name
ro: Nume

source: Method
ro: Metoda

source: Appointment History
ro: Istoric Programări

source: Pending
ro: În așteptare

source: Finished
ro: Finalizat

source: Completed/Total
ro: Finalizate/Total

# noMedicationsFoundPeriod
source: No medications found for this period
ro: Nu s-au găsit medicamente pentru această perioadă

# noFeedingDataFoundPeriod
source: No feeding data found for this period
ro: Nu s-au găsit date de hrănire pentru această perioadă

# noVeterinaryAppointmentsFoundPeriod
source: No veterinary appointments found for this period
ro: Nu s-au găsit programări veterinare pentru această perioadă

# shareFunctionalityPlaceholder
source: Share functionality would be implemented here
ro: Funcționalitatea de partajare ar fi implementată aici

source: Delete Report
ro: Șterge Raport

# deleteReportConfirmation
source: Are you sure you want to delete the "{reportName}" report from {date}?
ro: Sigur doriți să ștergeți raportul "{reportName}" din {date}?

source: Report deleted successfully
ro: Raport șters cu succes

source: Report Configuration
ro: Configurare Raport

source: Report Type
ro: Tip Raport

# pleaseSelectReportType
source: Please select a report type
ro: Vă rugăm să selectați un tip de raport

source: Date Range
ro: Interval de Date

source: Quick Ranges
ro: Intervale Rapide

# healthSummaryDescription
source: Comprehensive overview including recent medications, appointments, and activities for the selected period.
ro: Prezentare generală cuprinzătoare incluzând medicamente recente, programări și activități pentru perioada selectată.

# medicationHistoryDescription
source: Detailed list of all medications with dates, dosages, and completion status for the selected period.
ro: Lista detaliată a tuturor medicamentelor cu date, dozaje și stare de finalizare pentru perioada selectată.

# activityReportDescription
source: Analysis of walks, exercise patterns, and activity trends over the selected time frame.
ro: Analiză a plimbărilor, tiparelor de exerciții și tendințelor de activitate pe parcursul perioadei selectate.

# veterinaryRecordsDescription
source: Complete record of all veterinary appointments with outcomes and notes for the selected period.
ro: Înregistrare completă a tuturor programărilor veterinare cu rezultate și notițe pentru perioada selectată.

# selectReportTypeDescription
source: Select a report type to see its description.
ro: Selectați un tip de raport pentru a vedea descrierea acestuia.

source: End date must be after start date
ro: Data de încheiere trebuie să fie după data de început

source: Last 7 Days
ro: Ultimele 7 Zile

source: Last 30 Days
ro: Ultimele 30 Zile

source: Last 3 months
ro: Ultimele 3 luni

source: Last 6 months
ro: Ultimele 6 luni

source: Last year
ro: Anul trecut

source: Report generated successfully!
ro: Raport generat cu succes!

# failedToGenerateReport
source: Failed to generate report: {error}
ro: Generarea raportului a eșuat: {error}

source: Medication History
ro: Istoric Medicamente

source: Edit
ro: Editează

source: Confirm Delete
ro: Confirmă Ștergerea

# deleteConfirmationMessage
source: Are you sure you want to delete this feeding?
ro: Sigur doriți să ștergeți această hrănire?

# feedingDeleted
source: Feeding deleted successfully
ro: Hrănire ștearsă cu succes

source: Pet
ro: Animal

# pleaseSelectPet
source: Please select a pet
ro: Selectați un animal

source: Please enter amount
ro: Introduceți cantitatea

source: Add notes (optional)
ro: Adăugați notițe (opțional)

source: Feeding Time
ro: Ora Hrănirii

source: Edit Feeding
ro: Editează Hrănire

source: Pet Profiles
ro: Profile Animale

source: Add Pet
ro: Adaugă Animal

source: Setup Pet Profile
ro: Configurați profilul animalului

source: Edit Pet Profile
ro: Editați profilul animalului

source: Pet Name
ro: Numele animalului

# pleaseEnterPetName
source: Please enter your pet's name
ro: Vă rugăm să introduceți numele animalului

source: Species
ro: Specie

# speciesHint
source: e.g., Dog, Cat, Bird
ro: de ex., Câine, Pisică, Pasăre

# pleaseEnterSpecies
source: Please enter your pet's species
ro: Vă rugăm să introduceți specia animalului

source: Breed
ro: Rasă

source: Breed (optional)
ro: Rasă (opțional)

# breedHint
source: e.g., Golden Retriever, Persian
ro: de ex., Golden Retriever, Persană

# breedGermanShepherd
source: German Shepherd
ro: Ciobănesc German

# breedPoodle
source: Poodle
ro: Pudel

# breedSiberianHusky
source: Siberian Husky
ro: Husky Siberian

# breedGreatDane
source: Great Dane
ro: Dog German

# breedMixedBreed
source: Mixed Breed
ro: Rasă Mixtă

# breedPersian
source: Persian
ro: Persan

# breedSiamese
source: Siamese
ro: Siamez

# breedAbyssinian
source: Abyssinian
ro: abisinian

# breedNorwegianForest
source: Norwegian Forest
ro: Pădure Norvegiană

# breedParakeet
source: Parakeet
ro: Perușă

# breedCockatiel
source: Cockatiel
ro: Nimfă

# breedCanary
source: Canary
ro: Canar

# breedParrot
source: Parrot
ro: Papagal

# breedLovebird
source: Lovebird
ro: Agapornis

# breedFinch
source: Finch
ro: Pintene

# breedCockatoo
source: Cockatoo
ro: Cacadu

# breedMacaw
source: Macaw
ro: Ara

# breedAfricanGrey
source: African Grey
ro: Jako

# breedNetherlandDwarf
source: Netherland Dwarf
ro: Pitic Olandez

# breedLionhead
source: Lionhead
ro: Cap de Leu

# breedFlemishGiant
source: Flemish Giant
ro: Gigant Flamand

# breedEnglishAngora
source: English Angora
ro: Angora Englezesc

# breedDutch
source: Dutch
ro: Olandez

# breedOther
source: Other (Custom)
ro: Alta (Personalizată)

source: Custom Breed
ro: Rasă Personalizată

# enterCustomBreed
source: Enter your pet's breed
ro: Introduceți rasa animalului

source: Birthday (optional)
ro: Zi de naștere (opțional)

source: Tap to select birthday
ro: Atingeți pentru a selecta ziua de naștere

source: Select pet birthday
ro: Selectați ziua de naștere a animalului

source: Notes (optional)
ro: Notițe (opțional)

# petNotesHint
source: Any special notes about your pet
ro: Notițe speciale despre animalul dumneavoastră

# speciesDog
source: Dog
ro: Câine

# speciesCat
source: Cat
ro: Pisică

# speciesBird
source: Bird
ro: Pasăre

# speciesRabbit
source: Rabbit
ro: Iepure

# speciesGuineaPig
source: Guinea Pig
ro: Cobai

# speciesFish
source: Fish
ro: Pește

# speciesTurtle
source: Turtle
ro: Broască țestoasă

# speciesLizard
source: Lizard
ro: Șopârlă

# speciesSnake
source: Snake
ro: Șarpe

# speciesFerret
source: Ferret
ro: Dihor

# speciesRat
source: Rat
ro: Șobolan

# speciesMouse
source: Mouse
ro: Șoarece

# speciesHedgehog
source: Hedgehog
ro: Arici

# speciesParrot
source: Parrot
ro: Papagal

# speciesHorse
source: Horse
ro: Cal

# speciesChicken
source: Chicken
ro: Găină

# speciesOther
source: Other (Custom)
ro: Alta (Personalizată)

source: Custom Species
ro: Specie Personalizată

# enterCustomSpecies
source: Enter your pet's species
ro: Introduceți specia animalului

source: Change Photo
ro: Schimbă fotografia

source: Save Profile
ro: Salvează profilul

source: Update Profile
ro: Actualizează profilul

source: All Profiles
ro: Toate Profilele

# activeProfile
source: ACTIVE
ro: ACTIV

source: No pets yet!
ro: Niciun animal încă!

# addYourFirstPet
source: Add your first pet to get started
ro: Adaugă primul tău animal pentru a începe

source: Make Active
ro: Marchează ca Activ

source: Delete Profile
ro: Șterge Profil

# deleteProfileConfirm
source: Are you sure you want to delete {petName}'s profile? This action cannot be undone.
ro: Sigur doriți să ștergeți profilul lui {petName}? Această acțiune nu poate fi anulată.

# profileDeleted
source: {petName}'s profile deleted
ro: Profilul lui {petName} a fost șters

source: Failed to delete profile
ro: Ștergerea profilului a eșuat

# nowActive
source: {petName} is now your active pet
ro: {petName} este acum animalul tău activ

# failedToActivateProfile
source: Failed to activate profile: {error}
ro: Activarea profilului a eșuat: {error}

source: Error loading profiles
ro: Eroare la încărcarea profilelelor

# yearsOld
source: {age} year{plural} old
ro: {age} an{plural}

source: Settings
ro: Setări

source: Account Settings
ro: Setări Cont

source: Language
ro: Limbă

source: App Preferences
ro: Preferințe Aplicație

source: Theme
ro: Temă

source: Light
ro: Luminos

source: Dark
ro: Întunecat

source: System
ro: Sistem

source: Notifications
ro: Notificări

# enableNotifications
source: Enable app notifications
ro: Activează notificările aplicației

source: Enable analytics
ro: Activează analiza

# helpImproveApp
source: Help improve the app
ro: Ajută la îmbunătățirea aplicației

source: Data Management
ro: Gestionare Date

source: Export data
ro: Exportă datele

source: Download your data
ro: Descarcă datele tale

source: Clear cache
ro: Șterge memoria cache

# freeUpSpace
source: Free up storage space
ro: Eliberează spațiu de stocare

source: Delete account
ro: Șterge contul

# deleteAccountPermanently
source: Permanently delete your account
ro: Șterge definitiv contul tău

# privacyAndLegal
source: Privacy & Legal
ro: Confidențialitate și Legal

source: Privacy Policy
ro: Politica de confidențialitate

source: Terms of Service
ro: Termeni și condiții

source: Open source licenses
ro: Licențe open source

source: Could not open link
ro: Nu s-a putut deschide linkul

source: About
ro: Despre

source: App version
ro: Versiunea aplicației

source: Pet Owner
ro: Proprietar Animal

source: Select Language
ro: Selectează Limba

source: Select Theme
ro: Selectează Tema

# clearCacheConfirm
source: Are you sure you want to clear the cache? This action cannot be undone.
ro: Sigur doriți să ștergeți memoria cache? Această acțiune nu poate fi anulată.

# cacheCleared
source: Cache cleared successfully
ro: Memoria cache a fost ștearsă cu succes

# deleteAccountConfirm
source: Are you sure you want to delete your account? This action is permanent and cannot be undone. All your data will be lost.
ro: Sigur doriți să ștergeți contul? Această acțiune este permanentă și nu poate fi anulată. Toate datele tale vor fi pierdute.

# accountDeletedSuccessfully
source: All data deleted successfully
ro: Toate datele au fost șterse cu succes

# accountDeletionFailed
source: Failed to delete data. Please try again.
ro: Eroare la ștergerea datelor. Vă rugăm să încercați din nou.

source: Feature coming soon
ro: Funcționalitate în curând

source: Edit Profile
ro: Editare Profil

source: Profile Edit
ro: Editare Profil

source: No reports found
ro: Niciun raport găsit

source: No health reports found
ro: Niciun raport medical găsit

source: No medication reports found
ro: Niciun raport de medicație găsit

source: No activity reports found
ro: Niciun raport de activitate găsit

# noReportsMatchSearch
source: No reports match your search
ro: Niciun raport nu se potrivește căutării

source: Error loading reports
ro: Eroare la încărcarea rapoartelor

source: Error loading schedule
ro: Eroare la încărcarea programului

source: Overdue
ro: Întârziat

source: Just now
ro: Chiar acum

# daysAgo
source: {count, plural, =1{1 day ago} other{{count} days ago}}
ro: {count, plural, =1{1 zi în urmă} other{{count} zile în urmă}}

# hoursAgo
source: {count, plural, =1{1 hour ago} other{{count} hours ago}}
ro: {count, plural, =1{1 oră în urmă} other{{count} ore în urmă}}

# minutesAgo
source: {count, plural, =1{1 minute ago} other{{count} minutes ago}}
ro: {count, plural, =1{1 minut în urmă} other{{count} minute în urmă}}

source: Done
ro: Terminat

source: Mark Pending
ro: Marchează ca În așteptare

source: Mark Completed
ro: Marchează ca Finalizat

# daysUntil
source: In
ro: În

source: Started
ro: A început

source: Ends
ro: Se termină

source: Reminders
ro: Memento-uri

source: Add Reminder
ro: Adaugă Memento

source: Edit Reminder
ro: Editează Memento

source: Reminder Type
ro: Tip Memento

# reminderTitle
source: Title
ro: Titlu

# reminderDescription
source: Description
ro: Descriere

source: Scheduled Time
ro: Ora Programată

source: Once
ro: O singură dată

source: Daily
ro: Zilnic

source: Twice Daily
ro: De două ori pe zi
