Repository: hammerheart92/FurFriendDiary
Catalog: lib/l10n/app_*.arb
Languages: ro

# protocolApplyFailed
source: Failed to apply vaccination protocol
ro: Nu s-a putut aplica protocolul de vaccinare

# noProtocolsAvailable
source: No vaccination protocols available for this pet's species
ro: Nu există protocoale de vaccinare pentru specia acestui animal

# noProtocolsForSpecies
source: No vaccination protocols found for {species}. Contact your veterinarian for guidance.
ro: Nu s-au găsit protocoale de vaccinare pentru {species}. Consultați-vă veterinarul pentru îndrumare.

# loadingProtocols
source: Loading vaccination protocols...
ro: Se încarcă protocoalele de vaccinare...

source: Failed to load protocols
ro: Nu s-au putut încărca protocoalele

# andXMore
source: ...and {count} more
ro: ...și încă {count}

# requiredVaccine
source: Required
ro: Obligatoriu

# optionalVaccine
source: Optional
ro: Opțional

# atWeeksAge
source: at {weeks} weeks
ro: la {weeks} săptămâni

source: Protocol Details
ro: Detalii protocol

source: View Full Details
ro: Vezi detaliile complete

source: View Full Schedule
ro: Vezi programul complet

source: Reminder Settings
ro: Setări Memento-uri

source: Configure Reminders
ro: Configurează Memento-uri

# reminderSettingsFor
source: Reminder Settings for {eventType}
ro: Setări Memento-uri pentru {eventType}

source: Enable Reminders
ro: Activează Memento-uri

source: Disable Reminders
ro: Dezactivează Memento-uri

source: Reminder Timing
ro: Cronologie Memento-uri

# selectWhenToReceiveReminders
source: Select when you'd like to receive reminders before upcoming {eventType} events
ro: Selectează când dorești să primești memento-uri înainte de evenimentele {eventType}

# threeDaysBefore
source: 3 days before
ro: Cu 3 zile înainte

# oneWeekBefore
source: 1 week before
ro: Cu 1 săptămână înainte

# twoWeeksBefore
source: 2 weeks before
ro: Cu 2 săptămâni înainte

source: Save Reminder Settings
ro: Salvează Setările Memento-uri

# reminderSettingsSaved
source: Reminder settings saved successfully
ro: Setările memento-urilor au fost salvate cu succes

# reminderSettingsSaveFailed
source: Failed to save reminder settings
ro: Salvarea setărilor memento-urilor a eșuat

source: No reminders selected
ro: Niciun memento selectat

# selectAtLeastOneReminder
source: Please select at least one reminder time
ro: Selectează cel puțin un moment pentru memento

source: Loading reminder settings...
ro: Se încarcă setările memento-urilor...

source: Failed to load reminder settings
ro: Încărcarea setărilor memento-urilor a eșuat

source: Vaccination Reminders
ro: Memento-uri Vaccinare

source: Deworming Reminders
ro: Memento-uri Deparazitare

source: Appointment Reminders
ro: Memento-uri Programări

source: Medication Reminders
ro: Memento-uri Medicamente

# treatmentPlanViewer
source: Treatment Plans
ro: Planuri de tratament

source: Active Treatment Plans
ro: Planuri de tratament active

source: Loading treatment plans...
ro: Se încarcă planurile de tratament...

source: Failed to load treatment plans
ro: Nu s-au putut încărca planurile de tratament

source: No Active Treatment Plans
ro: Niciun plan de tratament activ

# noActiveTreatmentPlansMessage
source: You don't have any active treatment plans for this pet.
ro: Nu există planuri de tratament active pentru acest animal de companie.

# tasksComplete
source: {completed} of {total} tasks complete
ro: {completed} din {total} sarcini finalizate

source: Mark Plan Complete
ro: Marchează planul ca finalizat

# planMarkedComplete
source: Treatment plan marked as complete
ro: Planul de tratament a fost marcat ca finalizat

# failedToMarkPlanComplete
source: Failed to mark plan as complete
ro: Nu s-a putut marca planul ca finalizat

source: Confirm Mark Complete
ro: Confirmă finalizarea

# confirmMarkCompleteMessage
source: Are you sure you want to mark "{planName}" as complete? This action cannot be easily undone.
ro: Sigur dorești să marchezi planul "{planName}" ca finalizat? Această acțiune nu poate fi anulată ușor.

# taskUpdated
source: Task updated successfully
ro: Sarcina a fost actualizată cu succes

# taskCompletionFailed
source: Failed to update task
ro: Nu s-a putut actualiza sarcina

source: Due Today
ro: Astăzi

# prescribedBy
source: Prescribed by {veterinarian}
ro: Prescris de {veterinarian}

# startedOn
source: Started on {date}
ro: Început la {date}

source: Vaccinations
ro: Vaccinări

source: Deworming
ro: Deparazitări

source: No Events on This Day
ro: Niciun eveniment în această zi

# selectAnotherDay
source: Select another day to view scheduled care events
ro: Selectați o altă zi pentru a vedea evenimentele programate

source: No Upcoming Care Events
ro: Niciun eveniment viitor

# setupProtocolsToSeeEvents
source: Set up vaccination protocols and appointments to see them here
ro: Configurați protocoale de vaccinare și programări pentru a le vedea aici

source: Set Up Protocols
ro: Configurează protocoale

# failedToLoadCalendar
source: Failed to load calendar events
ro: Încărcarea calendarului a eșuat

source: Loading calendar...
ro: Se încarcă calendarul...

# eventSingular
source: event
ro: eveniment

# eventPlural
source: events
ro: evenimente

source: Vaccination details coming soon
ro: Detaliile vaccinării vor fi disponibile în curând

source: Deworming details coming soon
ro: Detaliile deparazitării vor fi disponibile în curând

source: Appointment details coming soon
ro: Detaliile programării vor fi disponibile în curând

source: Tap to view details
ro: Apăsați pentru a vedea detaliile

# eventsOnDate
source: {count} {count, plural, =1{event} other{events}} on {date}
ro: {count} {count, plural, =1{eveniment} other{evenimente}} pe {date}

source: Vaccination Status
ro: Stare vaccinare

source: Deworming Status
ro: Stare deparazitare

# noDewormingProtocol
source: No deworming protocol selected
ro: Niciun protocol de deparazitare selectat

source: Next treatment
ro: Următorul tratament

# selectDewormingProtocol
source: Select Protocol
ro: Selectează protocol

# dewormingProtocolDetails
source: Protocol details
ro: Detalii protocol

source: View deworming schedule
ro: Vizualizează program deparazitare

# chooseDewormingProtocol
source: Choose a protocol that matches your pet's parasite prevention needs
ro: Alege un protocol potrivit pentru prevenirea paraziților

# dewormingProtocolApplied
source: Deworming protocol applied to {petName}
ro: Protocol de deparazitare aplicat pentru {petName}

# dewormingProtocolApplyFailed
source: Failed to apply deworming protocol
ro: Nu s-a putut aplica protocolul de deparazitare

# treatmentsCount
source: {count} treatments
ro: {count} tratamente

# internalDeworming
source: Internal
ro: Intern

# externalDeworming
source: External
ro: Extern

source: Vaccination Protocol
ro: Protocol de Vaccinare

# isThisVaccination
source: Is this a vaccination?
ro: Este o vaccinare?

# regularMedication
source: Regular medication tracking
ro: Urmărire medicație obișnuită

source: Protocol-based vaccination
ro: Vaccinare bazată pe protocol

# pleaseSelectVaccinationProtocol
source: Please select a vaccination protocol
ro: Selectează un protocol de vaccinare

source: Next Dose Calculation
ro: Calcul Următoarea Doză

# calculatedFromProtocol
source: Calculated from protocol step {stepIndex}
ro: Calculat din pasul {stepIndex} al protocolului

source: (from protocol)
ro: (din protocol)

# recommendedDose
source: (recommended)
ro: (recomandat)

# petNeedsBirthday
source: Pet needs a birthday to calculate vaccination dates
ro: Animalul necesită o dată de naștere pentru a calcula datele de vaccinare

source: Dose
ro: Doză

source: Scheduled
ro: Programat

# notificationsActive
source: Notifications are active
ro: Notificările sunt active

# notificationsDisabled
source: Notifications are disabled
ro: Notificările sunt dezactivate

source: Remind me:
ro: Amintește-mi:

source: Day of
ro: În ziua evenimentului

# dayBefore
source: 1 day before
ro: Cu 1 zi înainte

# remindersActive
source: Active Reminders
ro: Memento-uri Active

source: Task completed
ro: Sarcină finalizată

source: Due date
ro: Data scadentă

# noTasksInPlan
source: No tasks in this treatment plan
ro: Nicio sarcină în acest plan de tratament

source: Loading deworming protocols...
ro: Se încarcă protocoalele de deparazitare...

source: Failed to load deworming protocols
ro: Încărcarea protocoalelor de deparazitare a eșuat

# noDewormingProtocolsAvailable
source: No deworming protocols available for this pet's species
ro: Nu există protocoale de deparazitare disponibile pentru această specie

# noDewormingProtocolsForSpecies
source: No deworming protocols found for {species}. Contact your veterinarian for guidance.
ro: Nu au fost găsite protocoale de deparazitare pentru {species}. Contactează medicul veterinar pentru îndrumări.

source: Go back
ro: Înapoi

source: No birthday set
ro: Data nașterii nu este setată

# addBirthdayToViewSchedule
source: Add your pet's birthday to view their deworming schedule
ro: Adaugă data nașterii animalului pentru a vedea programul de deparazitare

source: No schedule available
ro: Niciun program disponibil

# protocolMayNotApplyYet
source: This protocol may not apply to your pet yet
ro: Acest protocol s-ar putea să nu se aplice încă animalului tău

source: All treatments completed!
ro: Toate tratamentele finalizate!

# completedAllScheduledTreatments
source: Your pet has completed all scheduled treatments in this protocol
ro: Animalul tău a finalizat toate tratamentele programate în acest protocol

source: Treatment History
ro: Istoric Tratamente

source: Treatment {number}
ro: Tratamentul {number}

# regionLabel
source: Region: {region}
ro: Regiune: {region}

# birthDateLabel
source: Birth date: {date}
ro: Data nașterii: {date}

source: Deworming Treatment
ro: Tratament Deparazitare

source: Dose {number}
ro: Doza {number}

source: Vaccination
ro: Vaccinare

source: Veterinary Appointment
ro: Programare Veterinar

source: Medication
ro: Medicament

# ageMonthsShort
source: {count} mos
ro: {count, plural, =1{1 lună} few{{count} luni} other{{count} luni}}

# ageYearsShort
source: {count} yrs
ro: {count, plural, =1{1 an} few{{count} ani} other{{count} ani}}

# ageWeeksShort
source: {count} wks
ro: {count, plural, =1{1 săpt.} few{{count} săpt.} other{{count} săpt.}}

source: Add Vaccination
ro: Adaugă Vaccinare

source: Edit Vaccination
ro: Editează Vaccinare

source: Vaccination Information
ro: Informații Vaccinare

source: Vaccine Type
ro: Tip Vaccin

source: Select vaccine type
ro: Selectează tipul de vaccin

# pleaseSelectVaccineType
source: Please select a vaccine type
ro: Vă rugăm selectați un tip de vaccin

source: Pet Species
ro: Specia Animalului

source: Vaccines for
ro: Vaccinuri pentru

source: Dates
ro: Date

source: Administered Date
ro: Data Administrării

source: Next Due Date
ro: Data Următorului Rapel

source: Veterinary Details
ro: Detalii Veterinare

# optionalFields
source: All fields below are optional
ro: Toate câmpurile de mai jos sunt opționale

source: Batch Number
ro: Număr Lot

# batchNumberHint
source: e.g., BN12345
ro: de ex., BN12345

source: Veterinarian Name
ro: Nume Veterinar

# veterinarianNameHint
source: e.g., Dr. Smith
ro: de ex., Dr. Popescu

# clinicNameHint
source: e.g., City Vet Clinic
ro: de ex., Clinica Veterinară Centrală

# certificatePhotos
source: Vaccination Certificate
ro: Certificat de Vaccinare

# optionalCertificateHint
source: Upload photos of vaccination certificates for your records
ro: Încărcați fotografii ale certificatelor de vaccinare pentru evidența dumneavoastră

# vaccinationNotesHint
source: e.g., Pet tolerated vaccination well, no adverse reactions
ro: de ex., Animalul a tolerat bine vaccinarea, fără reacții adverse

source: Save Vaccination
ro: Salvează Vaccinarea

source: Update Vaccination
ro: Actualizează Vaccinarea

source: Vaccination added successfully
ro: Vaccinare adăugată cu succes

source: Vaccination updated successfully
ro: Vaccinare actualizată cu succes

# failedToAddVaccination
source: Failed to add vaccination: {error}
ro: Eroare la adăugarea vaccinării: {error}

# failedToUpdateVaccination
source: Failed to update vaccination: {error}
ro: Eroare la actualizarea vaccinării: {error}

source: Vaccination Details
ro: Detalii Vaccinare

source: Delete Vaccination
ro: Șterge Vaccinarea

# deleteVaccinationConfirm
source: Are you sure you want to delete this {vaccineType} vaccination? This action cannot be undone.
ro: Sigur doriți să ștergeți această vaccinare {vaccineType}? Această acțiune nu poate fi anulată.

source: Vaccination deleted successfully
ro: Vaccinare ștearsă cu succes

source: Failed to delete vaccination
ro: Eroare la ștergerea vaccinării

source: Vaccination not found
ro: Vaccinare negăsită

source: Generated from Protocol
ro: Generată din Protocol

source: Protocol Information
ro: Informații Protocol

source: Due Status
ro: Stare Scadență

source: Administered
ro: Administrat

# noVaccinations
source: No vaccinations yet
ro: Nu există vaccinări încă

# trackVaccinationRecords
source: Keep track of your pet's vaccination history and upcoming boosters
ro: Păstrați evidența istoricului de vaccinare și a rapelurilor viitoare ale animalului

source: Error loading vaccinations
ro: Eroare la încărcarea vaccinărilor

source: View details
ro: Vizualizează detalii
