Repository: hammerheart92/FurFriendDiary
Catalog: lib/l10n/app_*.arb
Languages: ro

source: Weekly
ro: Săptămânal

source: Custom
ro: Personalizat

source: Active Reminders
ro: Memento-uri Active

# noReminders
source: No reminders set
ro: Niciun memento setat

# noRemindersDescription
source: Add reminders to never forget important care tasks
ro: Adaugă memento-uri pentru a nu uita sarcini importante de îngrijire

source: Set Reminder
ro: Setează Memento

# oneDayBefore
source: 1 day before
ro: Cu 1 zi înainte

# oneHourBefore
source: 1 Hour Before
ro: Cu o oră înainte

# thirtyMinutesBefore
source: 30 Minutes Before
ro: Cu 30 de minute înainte

# reminderSet
source: Reminder set successfully
ro: Memento setat cu succes

source: Remind Daily
ro: Reamintește zilnic

source: Remind All Doses
ro: Reamintește toate dozele

source: Remind Once
ro: Reamintește o dată

source: First dose
ro: Prima doză

source: Custom time
ro: Timp personalizat

source: times daily
ro: ori pe zi

# remindersCreated
source: {count, plural, =1{Created 1 reminder} other{Created {count} reminders}}
ro: {count, plural, =1{S-a creat 1 memento} other{S-au creat {count} memento-uri}}

source: View
ro: Vizualizare

source: View All
ro: Vezi tot

source: Reminder deleted
ro: Memento șters

# nextReminder
source: Next: {time}
ro: Următor: {time}

source: Medication Reminder
ro: Memento Medicament

source: Appointment Reminder
ro: Memento Programare

source: Feeding Reminder
ro: Memento Hrănire

source: Walk Reminder
ro: Memento Plimbare

source: Remind me at
ro: Amintește-mi la

source: Remind 1 day before
ro: Amintește cu 1 zi înainte

source: Remind 1 hour before
ro: Amintește cu 1 oră înainte

source: Select Days
ro: Selectează Zilele

source: Select Time
ro: Selectează Ora

# reminderUpdated
source: Reminder updated successfully
ro: Memento actualizat cu succes

# reminderAdded
source: Reminder added successfully
ro: Memento adăugat cu succes

# pleaseEnterTitle
source: Please enter a title
ro: Introduceți un titlu

source: Failed to create reminder
ro: Eroare la crearea memento-ului

source: Failed to update reminder
ro: Eroare la actualizarea memento-ului

source: Failed to delete reminder
ro: Eroare la ștergerea memento-ului

source: Delete Reminder
ro: Șterge Memento

# deleteReminderConfirm
source: Are you sure you want to delete this reminder?
ro: Sigur doriți să ștergeți acest memento?

source: No active reminders
ro: Niciun memento activ

source: No inactive reminders
ro: Niciun memento inactiv

# linkToEntity
source: Link to existing item
ro: Leagă la element existent

source: Custom Schedule
ro: Program Personalizat

source: Repeat on
ro: Repetă în

source: Monday
ro: Luni

source: Tuesday
ro: Marți

source: Wednesday
ro: Miercuri

source: Thursday
ro: Joi

source: Friday
ro: Vineri

source: Saturday
ro: Sâmbătă

source: Sunday
ro: Duminică

source: Weight Tracking
ro: Urmărirea Greutății

source: Add Weight
ro: Adaugă Greutate

source: Edit Weight
ro: Editează Greutatea

source: Delete Weight
ro: Șterge Greutatea

# deleteWeightConfirm
source: Are you sure you want to delete this weight entry?
ro: Sigur doriți să ștergeți această înregistrare de greutate?

# weightDeleted
source: Weight entry deleted
ro: Înregistrarea greutății a fost ștearsă

source: Current Weight
ro: Greutatea Curentă

source: Weight
ro: Greutate

source: Weight Trend
ro: Tendință Greutate

source: History
ro: Istoric

# noWeightEntries
source: No weight entries yet
ro: Nu există înregistrări de greutate

# addWeightToTrack
source: Start tracking your pet's weight to monitor their health over time
ro: Începeți să urmăriți greutatea animalului pentru a monitoriza sănătatea în timp

# pleaseEnterWeight
source: Please enter a weight
ro: Vă rugăm să introduceți greutatea

# pleaseEnterValidWeight
source: Please enter a valid weight
ro: Vă rugăm să introduceți o greutate validă

# weightAdded
source: Weight entry added
ro: Înregistrarea greutății a fost adăugată

# weightUpdated
source: Weight entry updated
ro: Înregistrarea greutății a fost actualizată

source: About Weight Tracking
ro: Despre Urmărirea Greutății

# weightTrackingInfo
source: Regular weight monitoring helps detect health issues early. Track your pet's weight at consistent times (like weekly weigh-ins) for the most accurate trends.
ro: Monitorizarea regulată a greutății ajută la detectarea problemelor de sănătate timpuriu. Urmăriți greutatea animalului în momente consistente (cum ar fi cântăriri săptămânale) pentru cele mai precise tendințe.

# optionalNotes
source: Optional: Add notes about diet, activity, or health
ro: Opțional: Adăugați notițe despre dietă, activitate sau sănătate

source: Photo Gallery
ro: Galerie Foto

source: Add Photo
ro: Adaugă Fotografie

source: Take Photo
ro: Fă o Poză

source: Choose from Gallery
ro: Alege din Galerie

source: Choose Multiple Photos
ro: Selectează Mai Multe Fotografii

source: Delete Photo
ro: Șterge Fotografia

# deletePhotoConfirm
source: Are you sure you want to delete this photo? This action cannot be undone.
ro: Sigur doriți să ștergeți această fotografie? Această acțiune nu poate fi anulată.

source: Photo deleted
ro: Fotografia a fost ștearsă

source: Edit Caption
ro: Editează Descrierea

source: Caption
ro: Descriere

# addCaption
source: Add a caption...
ro: Adaugă o descriere...

source: No caption
ro: Fără descriere

source: Caption saved
ro: Descrierea a fost salvată

# noPhotos
source: No photos yet
ro: Nu există fotografii

# addFirstPhoto
source: Add your first photo to create memories
ro: Adaugă prima fotografie pentru a crea amintiri

# photoAdded
source: Photo added successfully
ro: Fotografia a fost adăugată cu succes

# photosAdded
source: {count, plural, =1{1 photo added} other{{count} photos added}}
ro: {count, plural, =1{1 fotografie adăugată} other{{count} fotografii adăugate}}

source: Processing photos...
ro: Se procesează fotografiile...

# cameraPermissionDenied
source: Camera permission is required to take photos
ro: Permisiunea camerei este necesară pentru a face fotografii

# storagePermissionDenied
source: Storage permission is required to access photos
ro: Permisiunea de stocare este necesară pentru a accesa fotografiile

# galleryPermissionDenied
source: Gallery permission is required to select photos
ro: Permisiunea galeriei este necesară pentru a selecta fotografii

source: Permission Denied
ro: Permisiune Refuzată

source: Open Settings
ro: Deschide Setările

source: Storage Used
ro: Spațiu Utilizat

source: Photos
ro: Fotografii

source: Date Taken
ro: Data Pozei

source: Date Added
ro: Data Adăugării

source: File Size
ro: Dimensiune Fișier

source: Photo Details
ro: Detalii Fotografie

source: Photo
ro: Fotografie

source: Share
ro: Distribuie

# setProfilePhoto
source: Set as Profile Photo
ro: Setează ca Fotografie de Profil

# setProfilePhotoConfirm
source: Set this photo as {petName}'s profile photo?
ro: Setezi această fotografie ca fotografie de profil pentru {petName}?

source: Confirm
ro: Confirmă

source: Profile photo updated!
ro: Fotografia de profil a fost actualizată!

source: Photo not found
ro: Fotografia nu a fost găsită

source: Medication Inventory
ro: Inventar Medicamente

source: Low Stock
ro: Stoc Scăzut

source: All Medications
ro: Toate Medicamentele

source: Statistics
ro: Statistici

source: Stock Quantity
ro: Cantitate Stoc

source: Stock Unit
ro: Unitate Stoc

# lowStockThreshold
source: Low Stock Alert
ro: Alertă Stoc Scăzut

source: Cost per Unit
ro: Cost per Unitate

source: Add Refill
ro: Adaugă Reumplere

source: Record Purchase
ro: Înregistrează Achiziție

source: Purchase History
ro: Istoric Achiziții

source: Quantity Purchased
ro: Cantitate Achiziționată

source: Purchase Date
ro: Data Achiziției

source: Pharmacy
ro: Farmacie

source: Total Spent
ro: Total Cheltuit

source: Average Cost per Unit
ro: Cost Mediu per Unitate

source: Days Until Empty
ro: Zile Până la Epuizare

# pillsLeft
source: {count} {unit} left
ro: {count} {unit} rămase

source: Low Stock Alert
ro: Alertă Stoc Scăzut

# refillReminder
source: Time to refill {medication}
ro: Este timpul să reumpli {medication}

source: Mark as Given
ro: Marchează ca Administrat

source: Add Stock
ro: Adaugă Stoc

# noPurchases
source: No purchases recorded
ro: Nicio achiziție înregistrată

# purchaseAdded
source: Purchase recorded
ro: Achiziție înregistrată

source: Stock updated
ro: Stoc actualizat

source: Cost per Month
ro: Cost pe Lună

source: Last Purchase
ro: Ultima Achiziție

source: Inventory Tracking
ro: Urmărire Inventar

source: Enable Refill Reminders
ro: Activează Mementouri Reumplere

# refillReminderDays
source: Remind me X days before empty
ro: Amintește-mi cu X zile înainte

source: pills
ro: pastile

source: doses
ro: doze

source: tablets
ro: tablete

# lowStockAlertBody
source: Only {count} {unit} left for {medication}
ro: Doar {count} {unit} rămase pentru {medication}

source: Refill Soon
ro: Reumple Curând

source: Not tracked
ro: Neurmărit

source: Initial Stock
ro: Stoc Inițial

source: Days before empty
ro: Zile înainte de epuizare

source: Inventory Overview
ro: Privire de Ansamblu Inventar

source: Total Cost
ro: Cost Total

source: Average Monthly Cost
ro: Cost Mediu Lunar

source: Medications Tracked
ro: Medicamente Urmărite

source: Total Purchases
ro: Total Achiziții

source: View History
ro: Vezi Istoric

source: Edit Purchase
ro: Editează Achiziție

source: Delete Purchase
ro: Șterge Achiziție

# deletePurchaseConfirm
source: Are you sure you want to delete this purchase record?
ro: Sigur doriți să ștergeți această înregistrare de achiziție?

source: Purchase deleted successfully
ro: Achiziție ștearsă cu succes

source: Failed to delete purchase
ro: Eșec la ștergerea achiziției

# invalidQuantity
source: Please enter a valid quantity
ro: Vă rugăm introduceți o cantitate validă

# invalidCost
source: Please enter a valid cost
ro: Vă rugăm introduceți un cost valid

source: Quantity
ro: Cantitate

source: Stock Level
ro: Nivel Stoc

source: Sufficient
ro: Suficient

source: Critical
ro: Critic

source: Refill Now
ro: Reumple Acum

source: View Inventory
ro: Vezi Inventar

source: No medications tracked
ro: Niciun medicament urmărit

source: No low stock medications
ro: Niciun medicament cu stoc scăzut

source: Total Spent This Month
ro: Total Cheltuit Luna Aceasta

source: Total Spent All Time
ro: Total Cheltuit Vreodată

source: All purchases
ro: Toate achizițiile

source: Average Cost per Medication
ro: Cost Mediu per Medicament

source: Per medication
ro: Per medicament

# topExpensiveMedications
source: Top 5 Most Expensive Medications
ro: Top 5 Cele Mai Scumpe Medicamente

source: Stock not tracked
ro: Stoc neurmărit

source: Refill
ro: Reumple

# notTrackedEnum
source: Not tracked
ro: Neurmărit

source: Veterinarians
ro: Veterinari

# addVet
source: Add Veterinarian
ro: Adaugă Veterinar

# editVet
source: Edit Veterinarian
ro: Editează Veterinar

# vetDetails
source: Veterinarian Details
ro: Detalii Veterinar

# vetName
source: Veterinarian Name
ro: Nume Veterinar

source: Clinic Name
ro: Nume Clinică

source: Specialty
ro: Specialitate

source: Phone Number
ro: Număr Telefon

source: Address
ro: Adresă

# setAsPreferred
source: Set as Preferred Vet
ro: Setează ca Veterinar Preferat

source: Preferred Vet
ro: Veterinar Preferat

source: General Practice
ro: Medicină Generală

source: Emergency Medicine
ro: Medicină de Urgență

source: Cardiology
ro: Cardiologie

source: Dermatology
ro: Dermatologie

source: Surgery
ro: Chirurgie

source: Orthopedics
ro: Ortopedie

source: Oncology
ro: Oncologie

source: Ophthalmology
ro: Oftalmologie

# callVet
source: Call Veterinarian
ro: Sună Veterinarul

# emailVet
source: Email Veterinarian
ro: Trimite Email Veterinarului

source: Open Website
ro: Deschide Website

source: Last Visit
ro: Ultima Vizită

source: Total Appointments
ro: Total Programări

source: Recent Appointments
ro: Programări Recente

# noVetsAdded
source: No veterinarians added
ro: Niciun veterinar adăugat

# addFirstVet
source: Add your pet's veterinarian to keep track of visits and contact information
ro: Adaugă veterinarul animalului tău pentru a urmări vizitele și informațiile de contact

# deleteVet
source: Delete Veterinarian
ro: Șterge Veterinar

# deleteVetConfirm
source: Are you sure you want to delete this veterinarian? This will not affect existing appointments.
ro: Sigur vrei să ștergi acest veterinar? Acest lucru nu va afecta programările existente.

# vetDeleted
source: Veterinarian deleted
ro: Veterinar șters

# vetAdded
source: Veterinarian added
ro: Veterinar adăugat

# vetUpdated
source: Veterinarian updated
ro: Veterinar actualizat

# selectVet
source: Select Veterinarian
ro: Selectează Veterinar

# addNewVet
source: Add New Veterinarian
ro: Adaugă Veterinar Nou

# invalidPhone
source: Invalid phone number
ro: Număr de telefon invalid

# invalidEmail
source: Invalid email address
ro: Adresă de email invalidă

# invalidWebsite
source: Invalid website URL
ro: URL website invalid

# vetNameRequired
source: Veterinarian name is required
ro: Numele veterinarului este obligatoriu

# clinicNameRequired
source: Clinic name is required
ro: Numele clinicii este obligatoriu

# searchVets
source: Search veterinarians...
ro: Caută veterinari...

# noVetsFound
source: No veterinarians found
ro: Niciun veterinar găsit

# noVetsMatchSearch
source: No veterinarians match your search
ro: Niciun veterinar nu corespunde căutării

source: Contact Information
ro: Informații de Contact

source: Vet not found
ro: Veterinar negăsit

# alreadyPreferred
source: This is already your preferred vet
ro: Acesta este deja veterinarul preferat

# errorOccurred
source: An error occurred
ro: A apărut o eroare

source: Pet Management
ro: Gestionarea animalelor de companie

# viewHealthScoresAndMetrics
source: View health scores and activity metrics
ro: Vizualizați scorurile de sănătate și indicatorii de activitate

source: Manage veterinarians and clinics
ro: Gestionarea medicilor veterinari și a clinicilor

source: View and manage pet photos
ro: Vizualizați și gestionați fotografiile animalelor de companie

source: Track medication stock levels
ro: Urmăriți nivelurile stocurilor de medicamente

# reportsAndAnalytics
source: Reports & Analytics
ro: Rapoarte & Analize

source: Health Score
ro: Scor Sănătate

source: Medication Adherence
ro: Respectarea Medicamentelor

source: Activity Levels
ro: Niveluri Activitate

source: Expense Tracking
ro: Urmărire Cheltuieli

source: Stable
ro: Stabil

source: Gaining
ro: Câștig

source: Losing
ro: Pierdere

source: Total Expenses
ro: Cheltuieli Totale

source: Average Weekly Expenses
ro: Cheltuieli Medii Săptămânale

source: Expense Breakdown
ro: Detaliere Cheltuieli

source: Report Period
ro: Perioada Raport

source: Last 90 Days
ro: Ultimele 90 Zile

source: Custom Range
ro: Interval Personalizat

source: Health Metrics
ro: Metrici Sănătate

source: Activity Metrics
ro: Metrici Activitate

source: Daily Activity Average
ro: Media activităților zilnice

# feedingsPerDay
source: Feedings/day
ro: Hrăniri/zi

# walksPerDay
source: Walks/day
ro: Plimbări/zi

source: Expense Metrics
ro: Metrici Cheltuieli

source: Overview
ro: Prezentare Generală

# activityHigh
source: High
ro: Ridicat

# activityMedium
source: Medium
ro: Mediu

# activityLow
source: Low
ro: Scăzut

source: Export to PDF
ro: Exportă în PDF

source: Share Report
ro: Partajează Raport

source: Export Options
ro: Opțiuni Export

source: Full Report
ro: Raport Complet

# fullReportDescription
source: Complete health report with all metrics
ro: Raport complet de sănătate cu toate metricile

source: Vet Summary
ro: Rezumat pentru Veterinar

# vetSummaryDescription
source: Last 30 days summary for vet visit
ro: Rezumat ultimele 30 zile pentru vizită veterinar

# shareText
source: Share Text Summary
ro: Partajează Rezumat Text

# shareTextDescription
source: Share as text message
ro: Partajează ca mesaj text

# reportGenerated
source: Report generated successfully
ro: Raport generat cu succes

# reportExported
source: Report saved to device
ro: Raport salvat pe dispozitiv

source: Generating report...
ro: Generare raport...

source: Exporting report...
ro: Exportare raport...

source: Sharing report...
ro: Partajare raport...

# reportSaved
source: Report saved to: {path}
ro: Raport salvat în: {path}

# failedToGeneratePDF
source: Failed to generate PDF: {error}
ro: Eroare la generarea PDF: {error}

source: Failed to export report
ro: Eroare la exportul raportului

source: Failed to share report
ro: Eroare la partajarea raportului

source: Recommendations
ro: Recomandări

# noDataAvailable
source: No data available for this period
ro: Nu sunt date disponibile pentru această perioadă

# insufficientData
source: Insufficient data for analysis
ro: Date insuficiente pentru analiză

source: Expenses by Category
ro: Cheltuieli pe Categorii

source: Average Monthly
ro: Medie Lunară

source: Top Categories
ro: Categorii Principale

# dismissRecommendation
source: Dismiss
ro: Respinge

source: Reporting Period
ro: Perioada Raportului

source: Data Insights
ro: Informații din Date

# noRecommendations
source: No recommendations available
ro: Nu sunt recomandări disponibile

# healthScoreExcellent
source: Excellent
ro: Excelent

# healthScoreGood
source: Good
ro: Bun

# healthScoreFair
source: Fair
ro: Satisfăcător

# healthScoreLow
source: Low
ro: Scăzut

source: Activity Level
ro: Nivel de Activitate

source: Expense Trend
ro: Tendință Cheltuieli

# trendIncreasing
source: Increasing
ro: În Creștere

# trendDecreasing
source: Decreasing
ro: În Scădere

# trendStable
source: Stable
ro: Stabil

source: Monthly Expenses
ro: Cheltuieli lunare

source: Average
ro: Medie

source: Highest
ro: Cel mai înalt

# excellentRange
source: Excellent (80+)
ro: Excelent (80+)

# goodRange
source: Good (60-79)
ro: Bun (60-79)

# fairRange
source: Fair (40-59)
ro: Satisfăcător (40-59)

# lowRange
source: Low (<40)
ro: Scăzut (<40)

# recSetMedicationReminders
source: Set more medication reminders to improve adherence
ro: Setați mai multe mementouri pentru medicamente pentru a îmbunătăți respectarea

# recConsiderVetWeightGain
source: Consider vet consultation about weight gain
ro: Luați în considerare consultarea unui medic veterinar în legătură cu creșterea în greutate

# recConsiderVetWeightLoss
source: Consider vet consultation about weight loss
ro: Luați în considerare consultarea unui medic veterinar în legătură cu pierderea în greutate

# recIncreaseDailyWalks
source: Increase daily walks for better health
ro: Creșteți numărul plimbărilor zilnice pentru o sănătate mai bună

# recReviewMedicationCosts
source: Review medication costs with your vet
ro: Revedeți costurile medicamentelor cu medicul veterinar

# recScheduleVetCheckup
source: Health score is low - schedule a vet checkup
ro: Scorul de sănătate este scăzut - programați un control veterinar

# healthScoreDescription
source: Based on weight stability, medication adherence, and activity levels
ro: Pe baza stabilității greutății, a respectării tratamentului medicamentos și a nivelului de activitate

# pdfPetHealthReport
source: Pet Health Report
ro: Raport privind starea de sănătate a animalului de companie

# pdfPetInformation
source: Pet Information
ro: Informații despre animalul de companie

# pdfName
source: Name
ro: Nume

# pdfSpecies
source: Species
ro: Specie

# pdfBreed
source: Breed
ro: Rasă

# pdfAge
source: Age
ro: Vârstă

# pdfYears
source: years
ro: ani

# pdfCat
source: Cat
ro: Pisică

# pdfDog
source: Dog
ro: Câine

# pdfUnknown
source: Unknown
ro: Necunoscut

# pdfReportPeriod
source: Report Period
ro: Perioada raportului

# pdfFrom
source: From
ro: De la

# pdfTo
source: To
ro: Până la

# pdfHealthMetrics
source: Health Metrics
ro: Indicatori de sănătate

# pdfOverallHealthScore
source: Overall Health Score
ro: Scorul general de sănătate

# pdfMedicationAdherence
source: Medication Adherence
ro: Aderarea la medicație

# pdfWeightTrend
source: Weight Trend
ro: Tendința greutății

# pdfStable
source: Stable
ro: Stabilă

# pdfGaining
source: Gaining
ro: Câștig

# pdfLosing
source: Losing
ro: Pierdere

# pdfActivitySummary
source: Activity Summary
ro: Rezumat activitate

# pdfTotalFeedings
source: Total Feedings
ro: Total hrăniri

# pdfTotalWalks
source: Total Walks
ro: Total plimbări

# pdfAvgFeedingsPerDay
source: Avg Feedings/Day
ro: Media hrăniri/zi

# pdfAvgWalksPerDay
source: Avg Walks/Day
ro: Media plimbări/zi

# pdfExpenses
source: Expenses
ro: Cheltuieli

# pdfTotalExpenses
source: Total Expenses
ro: Cheltuieli totale

# pdfGeneratedOn
source: Generated on
ro: Generat la

# pdfFooter
source: FurFriend Diary - Pet Health Management
ro: FurFriend Diary - Gestionarea sănătății animalului de companie

# pdfVeterinarySummary
source: Veterinary Summary
ro: Rezumat veterinar

# pdfLast30DaysSummary
source: Last 30 Days Summary
ro: Rezumat ultimele 30 de zile

# pdfHealthStatus
source: Health Status
ro: Starea de sănătate

# pdfHealthScore
source: Health Score
ro: Scorul de sănătate

# pdfMedicationCompliance
source: Medication Compliance
ro: Conformitatea cu medicația

# pdfActivityOverview
source: Activity Overview
ro: Prezentare generală a activității

# pdfDailyFeedingsAvg
source: Daily Feedings (Avg)
ro: Hrăniri zilnice (medie)

# pdfDailyWalksAvg
source: Daily Walks (Avg)
ro: Plimbări zilnice (medie)

# pdfNotes
source: Notes
ro: Note

# pdfNotesText
source: Please review the attached health data and discuss any concerns during the appointment.
ro: Vă rugăm să revizuiți datele de sănătate atașate și să discutați orice preocupări în timpul programării.

# emailSubject
source: Pet Health Report
ro: Raport Sănătate Animale

# emailBody
source: Here is the health report for my pet.
ro: Acesta este raportul de sănătate pentru animalul meu.

# vetSummaryEmailSubject
source: Veterinary Summary
ro: Rezumat Veterinar

# vetSummaryEmailBody
source: Here is the veterinary summary for my pet.
ro: Acesta este rezumatul veterinar pentru animalul meu.

# textSummaryEmailSubject
source: Pet Health Summary
ro: Rezumat Sănătate Animale

# navHome
source: Home
ro: Acasă

# navFeedings
source: Feedings
ro: Hrănire

# navWalks
source: Walks
ro: Plimbări

# navMeds
source: Meds
ro: Med.

# navAppts
source: Appts
ro: Prog.

# navReports
source: Reports
ro: Rapoarte

# navSettings
source: Settings
ro: Setări

source: Next due
ro: Următoarea dată

source: Critical: Low Stock Alert
ro: Critic: Alertă stoc redus

# lowStockBody
source: Only {count} {unit} remaining. Time to refill!
ro: Mai sunt doar {count} {unit}. E timpul să reumpleți stocul!

# appointmentAt
source: {title} at {location}
ro: {title} la {location}

source: Select Protocol
ro: Selectează Protocol

source: Select Vaccination Protocol
ro: Selectează Protocolul de Vaccinare

# selectProtocolForPet
source: Select vaccination protocol for {petName}
ro: Selectează protocolul de vaccinare pentru {petName}

# chooseProtocolMatchingNeeds
source: Choose a protocol that matches your pet's vaccination needs
ro: Alege un protocol care se potrivește nevoilor de vaccinare ale animalului tău

# coreProtocol
source: Core
ro: Esențial

# extendedProtocol
source: Extended
ro: Extins

# predefinedProtocol
source: Predefined
ro: Predefinit

source: Current protocol
ro: Protocol curent

# customProtocol
source: Custom
ro: Personalizat

# vaccinationsCount
source: {count} vaccinations
ro: {count} vaccinări

source: Confirm Protocol Selection
ro: Confirmă selecția protocolului

source: Apply Protocol
ro: Aplică protocolul

# applyProtocolToPet
source: Apply {protocolName} to {petName}
ro: Aplică {protocolName} la {petName}

# protocolAppliedSuccess
source: Vaccination protocol applied to {petName}
ro: Protocolul de vaccinare a fost aplicat la {petName}
